---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltGripLength
source: html/f2fd2e72-d722-07bf-3064-94d34cb7385a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltGripLength Property

"Grip Length"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemBoltGripLength { get; }
```